publish_html/2016/javascriptdevelop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>javascript高级程序设计（第三版）读书笔记</title>
<!-- 2016-09-22 Thu 15:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dany" />
<link rel="stylesheet" type="text/css" href="../css/solarized-light.css"/>
</head>
<body>
<div id="content">
<h1 class="title">javascript高级程序设计（第三版）读书笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">第二章</a>
<ul>
<li><a href="#sec-1-1">引入javascript</a>
<ul>
<li><a href="#sec-1-1-1">async</a></li>
<li><a href="#sec-1-1-2">defer</a></li>
<li><a href="#sec-1-1-3">async 与defer的区别与联系</a>
<ul>
<li><a href="#sec-1-1-3-1">相同之处</a></li>
<li><a href="#sec-1-1-3-2">区别</a></li>
</ul>
</li>
<li><a href="#sec-1-1-4">type</a></li>
<li><a href="#sec-1-1-5">src</a></li>
</ul>
</li>
<li><a href="#sec-1-2">&lt;script&gt;标签</a>
<ul>
<li><a href="#sec-1-2-1">规范</a></li>
<li><a href="#sec-1-2-2">位置</a>
<ul>
<li><a href="#sec-1-2-2-1">放在&lt;head&gt; 里面</a></li>
<li><a href="#sec-1-2-2-2">放在&lt;body&gt; 后面</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-3">&lt;noscript&gt;标签</a></li>
</ul>
</li>
<li><a href="#sec-2">第三章</a>
<ul>
<li><a href="#sec-2-1">typeof 运算符</a>
<ul>
<li><a href="#sec-2-1-1">用法</a></li>
<li><a href="#sec-2-1-2">返回值</a>
<ul>
<li><a href="#sec-2-1-2-1">undefined</a></li>
<li><a href="#sec-2-1-2-2">boolean</a></li>
<li><a href="#sec-2-1-2-3">number</a></li>
<li><a href="#sec-2-1-2-4">object</a></li>
<li><a href="#sec-2-1-2-5">function</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-2">Object 类型</a>
<ul>
<li><a href="#sec-2-2-1">constructor</a></li>
<li><a href="#sec-2-2-2">hasOwnProperty(propertyName)</a></li>
<li><a href="#sec-2-2-3">isPrototypeOf(Ojbect)</a></li>
<li><a href="#sec-2-2-4">propertyIsEnumerable(propertyName)</a></li>
<li><a href="#sec-2-2-5">toLocalString()</a></li>
<li><a href="#sec-2-2-6">toString()</a></li>
<li><a href="#sec-2-2-7">valueOf()</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">第四章</a>
<ul>
<li><a href="#sec-3-1">基本类型和引用类型</a></li>
<li><a href="#sec-3-2">instanceof 运算符</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
JS学习笔记
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">第二章</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">引入javascript</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">async</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
立刻下载脚本，不妨碍其他的操作。只对外部文件有效
</p>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">defer</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
脚本可以延迟到文档完全被解析和显示之后再被执行。只对外部文件有效
</p>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">async 与defer的区别与联系</h4>
<div class="outline-text-4" id="text-1-1-3">
</div><div id="outline-container-sec-1-1-3-1" class="outline-5">
<h5 id="sec-1-1-3-1">相同之处</h5>
<div class="outline-text-5" id="text-1-1-3-1">
<p>
都是异步加载
</p>
</div>
</div>
<div id="outline-container-sec-1-1-3-2" class="outline-5">
<h5 id="sec-1-1-3-2">区别</h5>
<div class="outline-text-5" id="text-1-1-3-2">
<p>
异步加载完成之后，async方式加载的脚本会立刻被执行，不管文档是否被加载完。defer方式加载的脚本会等文档被解析显示之后才会被执行。理论上会在DOMContentLoaded事件之前执行，并且执行的顺序会按照引用的顺序，但实际情况未知.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4">type</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
虽然text/javascript和text／ecmascript已经不推荐被使用，目前依旧还是使用text/javascript。如果不指定这个值，默认的仍是text/javascript。
</p>
</div>
</div>
<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5">src</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
引入外部文件。
一个script标签引入外部文件的同时包含了额外的javascript代码，嵌入的代码会被忽略.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">&lt;script&gt;标签</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">规范</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
引入javascript文件&lt;script /&gt;标签是xhtml的规范，不是html的，html的规范是必须&lt;script&gt;&lt;/script&gt;
</p>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">位置</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><div id="outline-container-sec-1-2-2-1" class="outline-5">
<h5 id="sec-1-2-2-1">放在&lt;head&gt; 里面</h5>
<div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">

<pre class="src src-html">&lt;html&gt;
&lt;head&gt; 
&lt;script&gt;&lt;/script&gt;
&lt;script&gt;&lt;/script&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;!-- 这放内容--&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>
<p>
要等所有的javascript文件下载，解析，执行完毕之后，才会呈现body的内容，这会导致出现明显的延迟，而且在延迟期间，浏览器是空白的。
</p>
</div>
</div>
<div id="outline-container-sec-1-2-2-2" class="outline-5">
<h5 id="sec-1-2-2-2">放在&lt;body&gt; 后面</h5>
<div class="outline-text-5" id="text-1-2-2-2">
<div class="org-src-container">

<pre class="src src-html">&lt;html&gt;
&lt;head&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;!--这里放内容--&gt;
&lt;script&gt;&lt;/script&gt;
&lt;/body&gt;
&lt;html&gt;
</pre>
</div>
<p>
这样在加载解析javascript之前，页面内容将完全呈现出来。用户也因浏览器空白页显示时间缩短，而感觉加载页面速度变快了.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">&lt;noscript&gt;标签</h3>
<div class="outline-text-3" id="text-1-3">
<p>
该标签在不支持javascript的浏览器，或者javascript被禁用的情况下，会显示里面的内容，里面的内容是html里面可以放在&lt;body&gt;标签内的，除了&lt;script&gt;之外的标签
</p>
<div class="org-src-container">

<pre class="src src-html">&lt;html&gt;
&lt;head&gt;
&lt;/head&gt;
&lt;body&gt;
&lt;noscript&gt;
&lt;p&gt; 本页需要浏览器支持（启用）javascript.
&lt;/noscript&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">第三章</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">typeof 运算符</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">用法</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">

<pre class="src src-javascript">let message ="hi";
alert(typeof(message));//string
alert(typeof message);//string 不带括号也是正确的
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">返回值</h4>
<div class="outline-text-4" id="text-2-1-2">
</div><div id="outline-container-sec-2-1-2-1" class="outline-5">
<h5 id="sec-2-1-2-1">undefined</h5>
<div class="outline-text-5" id="text-2-1-2-1">
<p>
值未定义的时候
</p>
</div>
</div>
<div id="outline-container-sec-2-1-2-2" class="outline-5">
<h5 id="sec-2-1-2-2">boolean</h5>
<div class="outline-text-5" id="text-2-1-2-2">
<p>
值是布尔值
</p>
</div>
</div>
<div id="outline-container-sec-2-1-2-3" class="outline-5">
<h5 id="sec-2-1-2-3">number</h5>
<div class="outline-text-5" id="text-2-1-2-3">
<p>
值是数值
</p>
</div>
</div>
<div id="outline-container-sec-2-1-2-4" class="outline-5">
<h5 id="sec-2-1-2-4">object</h5>
<div class="outline-text-5" id="text-2-1-2-4">
<p>
值是对象或者null
</p>
</div>
</div>
<div id="outline-container-sec-2-1-2-5" class="outline-5">
<h5 id="sec-2-1-2-5">function</h5>
<div class="outline-text-5" id="text-2-1-2-5">
<p>
值是函数
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Object 类型</h3>
<div class="outline-text-3" id="text-2-2">
<p>
每个类型都有的属性和方法
</p>
</div>
<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">constructor</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
保存创造当前对象的函数
</p>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">hasOwnProperty(propertyName)</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
检查给定的属性在当前实例中（而不是原型）是否存在。
</p>
</div>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">isPrototypeOf(Ojbect)</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
检查传入的对象是否是当前对象的原型
</p>
</div>
</div>
<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4">propertyIsEnumerable(propertyName)</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
检查给定的属性能否使用for-in语句来枚举
</p>
</div>
</div>
<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5">toLocalString()</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
返回对象的字符串表示，该字符串雨执行环境的地区对应
</p>
</div>
</div>
<div id="outline-container-sec-2-2-6" class="outline-4">
<h4 id="sec-2-2-6">toString()</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
返回对象的字符串表示
</p>
</div>
</div>
<div id="outline-container-sec-2-2-7" class="outline-4">
<h4 id="sec-2-2-7">valueOf()</h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
返回对象的字符串、数值或布尔表示，通常与toString（）返回值相同
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">第四章</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">基本类型和引用类型</h3>
<div class="outline-text-3" id="text-3-1">
<p>
基本类型无法添加动态属性,引用类型可以，string属于基本类型
</p>
<div class="org-src-container">

<pre class="src src-javascript">var person = new Object();
person.name = "Nicholas";
alert(person.name);//Nicholas

var name = "Nicholas";
name.age = 27;
alert(name.age);//undefined
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">instanceof 运算符</h3>
<div class="outline-text-3" id="text-3-2">
<p>
语法:variable instanceof constructor 如果变量是给定引用类型的实例，那么instanceof就会返回true
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: dany</p>
<p class="date">Created: 2016-09-22 Thu 15:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
